[
   {
      "etag":"\"Bdx4f4ps3xCOOo1WZ91nTLkRZ_c/cXyLI6753WG1k-4PLdcQ06OeKy0\"",
      "id":"UExpY0tJbHNWa0d3S3dmS21GOVAyaFhPeWV6NERvbkktSC45MEI3NjgzMTVFQkZGODYx",
      "kind":"youtube#playlistItem",
      "snippet":{
         "channelId":"UCFLThAQKBzF-zYV_MtR7t4A",
         "channelTitle":"wildturmeric",
         "description":"How To Treat Tooth Decay \u0026 Reverse Cavities Using This One Miracle Ingredient without going to the dentist. In this video, I wanted to share one amazing ingredient that not only prevents but reverses tooth decay as well. The ingredient is called \"Haritaki\" in Hindi and \"Kadukkai\" in Tamil. Its botanical name is Terminalia Chebula.\n\nHaritaki has been used from ancient times to treat and prevent tooth decay. Now even modern science has proved it to be true. I will leave the link that proves the anti cariogenic effects of haritaki in the description box below. Normally we use haritaki  in two ways - one is in the form of mouth rinse and another is a tooth powder. Both works well in preventing and treating tooth decay. For the mouth rinse, take one haritaki in a mortar and pestle. Now pound to break it into small pieces. Pounding haritaki helps it release it\u0027s\nessence into the water faster. But you have to pound hard to break haritaki. You don\u0027t have to pound it finely, just make sure it breaks. \n\nNow take the pounded haritaki in a pot. Add in a cup of water to it. Now boil this mixture in low to medium flame. After few minutes of boiling you\u0027ll find that the color of the water changes to light yellow in color. Now boil till the water reduces in half. Haritaki is an\namazing astringent and has wonderful antimicrobial properties making it one of the best ingredients to use for dental care. Once the water has reduced in half switch off, let cool completely and\nstrain. Your wonderful homemade mouthwash is ready! This mouth wash is three times more effective than any mouthwash sold in the markets. To use, gargle your mouth with this mouth wash every day. This mouth wash is slightly bitter but works really well in preventing and treating tooth decay. You can store the leftover mouthwash in the refrigerator and use for about a week. \n\nTo make the tooth powder, take a tablespoon of haritaki powder in a bowl. Add in quarter teaspoon of Himalayan pink salt to it. Mix well and store it in an airtight bottle. This homemade tooth powder will store well for about three months, if kept away from moisture. If used as a tooth powder weekly twice, I can guarantee that it will completely prevent tooth decay and treat it as well. Since haritaki is very famous in India, many departmental stores stock both haritaki and haritaki powder. You can also order them through online shops like Amazon.....\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d \n\nHi Friends, My name is Ramya. I live in a small village in India and am recording all the home remedies and beauty tips that has been practiced in our village for thousands of years. I hope you will find these videos useful and if you find these videos useful, please subscribe to get regular updates....\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nYOU CAN ALSO CONNECT WITH ME HERE:\n\nFOLLOW US ON GOOGLE+: https://plus.google.com/u/0/110176035620142654779\n\nFOLLOW US ON FACEBOOK: https://www.facebook.com/wildturmeric\n\nFOLLOW US ON TWITTER: https://twitter.com/wildturmeric\n\nFOLLOW US ON PINTEREST: https://in.pinterest.com/wildturmeric\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nDISCLAIMER: The information provided on this channel is not given by a health care professional. Though each and every remedy recorded in this channel has been tried by us, each and every one of us are different and might react differently to herbs. If in doubt please contact a health care professional. All the content published in this channel are our own.....\n.",
         "playlistId":"PLicKIlsVkGwKwfKmF9P2hXOyez4DonI-H",
         "position":0,
         "publishedAt":"2018-06-14T13:04:21.000Z",
         "resourceId":{
            "kind":"youtube#video",
            "videoId":"VYaKlmWQUqU"
         },
         "thumbnails":{
            "default":{
               "height":90,
               "url":"https://i.ytimg.com/vi/VYaKlmWQUqU/default.jpg",
               "width":120
            },
            "high":{
               "height":360,
               "url":"https://i.ytimg.com/vi/VYaKlmWQUqU/hqdefault.jpg",
               "width":480
            },
            "maxres":{
               "height":720,
               "url":"https://i.ytimg.com/vi/VYaKlmWQUqU/maxresdefault.jpg",
               "width":1280
            },
            "medium":{
               "height":180,
               "url":"https://i.ytimg.com/vi/VYaKlmWQUqU/mqdefault.jpg",
               "width":320
            },
            "standard":{
               "height":480,
               "url":"https://i.ytimg.com/vi/VYaKlmWQUqU/sddefault.jpg",
               "width":640
            }
         },
         "title":"How To Treat Tooth Decay \u0026 Reverse Cavities Using This One Miracle Ingredient (Clinically Proven)!"
      }
   },
   {
      "etag":"\"Bdx4f4ps3xCOOo1WZ91nTLkRZ_c/8_SGaGLrhf8uOPcWkt5giAAhAak\"",
      "id":"UExpY0tJbHNWa0d3S3dmS21GOVAyaFhPeWV6NERvbkktSC5ENjg3MEUyQ0IzODMzQThB",
      "kind":"youtube#playlistItem",
      "snippet":{
         "channelId":"UCFLThAQKBzF-zYV_MtR7t4A",
         "channelTitle":"wildturmeric",
         "description":"10 amazing health benefits, nutrition \u0026 side effects of wheatgrass juice and how to make it at home. In this video, I wanted to share about wheatgrass juice. I have been drinking wheatgrass juice regularly for the past 15 days in empty stomach and I wanted to share my experience with all of you. Wheatgrass are the young shoots of our common wheat whose botanical name is Tritium Aestivum. Wheatgrass shots also called as wheatgrass juice are popularly consumed all over the world as it has amazing health benefits.\n\nHOW TO GROW WHEATGRASS: https://www.wildturmeric.net/2018/03/wheatgrass-benefits-uses-nutrition-dosage.html\n\nWHEATGRASS HEALTH BENEFITS:\n Wheatgrass juice contains 70% chlorophyll which is an important blood builder so if you are anemic, wheatgrass juice will greatly help treat it. Many of us Indian women are anemic which is also one of the main reasons for hair fall. If you are suffering from severe hair loss, I would highly suggest taking wheatgrass juice daily.\n\nWheatgrass shots also reduces acidity so it helps treat stomach ulcer and irritable bowel syndrome. It also helps regulate blood sugar levels so it\u0027s great for diabetic patients too. It also helps detox our body naturally and keeps our digestion in peak order thus aiding in natural weight loss.\n\nWheatgrass juice contains 17 amino acids, vitamins and minerals, all essential for keeping our hair, skin and health in peak order. Since it\u0027s very rich in antioxidants, it greatly prevents premature aging too.\n\nTo make wheatgrass juice, we need fresh wheatgrass. Some health stores in India stock fresh wheatgrass but you can easily grow them at home. \n\nHOW TO MAKE WHEATGRASS JUICE AT HOME:\nWash the wheatgrass well in water to get rid of any dirt and take it in a mixer. Add little bit of water to it. Now grind it as finely as you can. Strain to get fresh wheatgrass juice. Take around 30 to 40 ml of this juice in empty stomach. After consuming it regularly for 15 days, the major change I felt was, I felt energized throughout the day, my hair and skin never felt this better. I would highly recommend this juice to everyone. I also prefer the fresh juice over the powder and also the fresh juice is more potent than the powder. This juice does not taste bad and has a slight grassy\nsmell to it which I don\u0027t mind considering the amazing health benefits.\n\nWHEATGRASS JUICE SIDE EFFECTS:\nIf you don\u0027t like the taste of the juice, mix it with fresh fruit juices like orange juice or apple juice. It is also one of the best ways to give it to young children. Some people might be allergic to wheatgrass. Usually one wheatgrass shot is around 30 to 45 ml, you can go as high as 60 ml but if you overdose on wheatgrass juice it will cause side effects like headache, diarrhea etc. It is also best to make wheatgrass juice at home and consume it immediately......\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d \n\nHi Friends, My name is Ramya. I live in a small village in India and am recording all the home remedies and beauty tips that has been practiced in our village for thousands of years. I hope you will find these videos useful and if you find these videos useful, please subscribe to get regular updates....\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nYOU CAN ALSO CONNECT WITH ME HERE:\n\nFOLLOW US ON GOOGLE+: https://plus.google.com/u/0/110176035620142654779\n\nFOLLOW US ON FACEBOOK: https://www.facebook.com/wildturmeric\n\nFOLLOW US ON TWITTER: https://twitter.com/wildturmeric\n\nFOLLOW US ON PINTEREST: https://in.pinterest.com/wildturmeric\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nDISCLAIMER: The information provided on this channel is not given by a health care professional. Though each and every remedy recorded in this channel has been tried by us, each and every one of us are different and might react differently to herbs. If in doubt please contact a health care professional. All the content published in this channel are our own.....\n.",
         "playlistId":"PLicKIlsVkGwKwfKmF9P2hXOyez4DonI-H",
         "position":1,
         "publishedAt":"2018-06-14T13:03:51.000Z",
         "resourceId":{
            "kind":"youtube#video",
            "videoId":"7Yn9b6Wo7SU"
         },
         "thumbnails":{
            "default":{
               "height":90,
               "url":"https://i.ytimg.com/vi/7Yn9b6Wo7SU/default.jpg",
               "width":120
            },
            "high":{
               "height":360,
               "url":"https://i.ytimg.com/vi/7Yn9b6Wo7SU/hqdefault.jpg",
               "width":480
            },
            "maxres":{
               "height":720,
               "url":"https://i.ytimg.com/vi/7Yn9b6Wo7SU/maxresdefault.jpg",
               "width":1280
            },
            "medium":{
               "height":180,
               "url":"https://i.ytimg.com/vi/7Yn9b6Wo7SU/mqdefault.jpg",
               "width":320
            },
            "standard":{
               "height":480,
               "url":"https://i.ytimg.com/vi/7Yn9b6Wo7SU/sddefault.jpg",
               "width":640
            }
         },
         "title":"I Took Wheatgrass Shots Every Morning For 15 Days, Here\u0027s What Happened!!!"
      }
   },
   {
      "etag":"\"Bdx4f4ps3xCOOo1WZ91nTLkRZ_c/_-grzIz1-PSXyM7k7H_OaIx6njM\"",
      "id":"UExpY0tJbHNWa0d3S3dmS21GOVAyaFhPeWV6NERvbkktSC5EODkyNDMzRkJBNkQ2NkMz",
      "kind":"youtube#playlistItem",
      "snippet":{
         "channelId":"UCFLThAQKBzF-zYV_MtR7t4A",
         "channelTitle":"wildturmeric",
         "description":"In this video I wanted to share three amazing remedies for menstrual pain that has been practiced for many years in our village. Though it is not surprising to see almost all our traditional remedies back by research now, it really makes me very happy because it will give many of the people the confidence to try these remedies. I am very very happy to say that all these three remedies are backed by research.\n\nFennel for periods pain: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3611645/\n\nAsafoetida for periods pain: https://www.sciencedirect.com/science/article/pii/S2210803317300489\n\nChamomile for pain relief: https://www.researchgate.net/publication/286965003_Chamomile_tea_for_relief_of_primary_dysmenorrhea\n\n3 HOME REMEDIES FOR MENSTRUAL CRAMPS:\n\n1. FENNEL SEEDS:\n\nFennel seeds also called the Saunf in Hindi and Sombu in Tamil is an amazing home remedy for menstrual pain. I was astonished to know that menstrual pain alone accounts for two billion dollars loss in productivity due to work absence. Home remedies like fennel tea will help treat it without any side effects. Fennel is effective for both gastric problems and menstrual pain. It has amazing antispasmodic properties that helps reduce the pain. Almost eighty percent of the girls in the study found complete relief, this is 7 percent more than the group given prescription medication which is amazing! For the remedy boil 1/2 teaspoon of fennel seeds and 1/2 cup of water till it reduces to quarter cup and strain. Drink this immediately when you have menstrual pain, you will have very good relief. Some women will experience nausea and bloating during their periods, this remedy will take care of that too.\n\n2. ASAFOETIDA:\n\nAsafoetida also called as hing in Hindi and Perungayam in Tamil is an another traditional home remedy for menstrual pain that has been proven through research. For the remedy, take a small piece of asafoetida in an iron kadai and fry in low flame till it changes color and swells up. It might take a minute or two, do it patiently in low flame. Switch off and let it cool completely. Now pound the asafoetida a mortar and  pestle. Since we have fried it, it will be very crispy and will powder very quickly. Now 2 pinches to a cup of buttermilk and drink. If you\u0027re vegan, mix it with plant-based yogurt thinned down with water. This remedy has been proven to be effective equal to prescription medication!\n\n3. CHAMOMILE TEA: \n\nThough this is not a traditional remedy, in my personal experience, I have found chamomile tea to be very effective in reducing the pain along with improving the mood. If you experience irritability and sleeplessness during your periods, I would highly recommend chamomile tea. To make the chamomile tea, boil 1/2 cup of water and pour over a chamomile tea bag. Wait for 2 minutes and sip the warm relaxing tea. I would highly suggest this tea before bedtime during your periods. Many of us take pain relief medications to treat periods pain instead follow these clinically proven remedies to get rid of menstrual pain. They\u0027re very effective but without any side effects.\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d \n\nHi Friends, My name is Ramya. I live in a small village in India and am recording all the home remedies and beauty tips that has been practiced in our village for thousands of years. I hope you will find these videos useful and if you find these videos useful, please subscribe to get regular updates....\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nYOU CAN ALSO CONNECT WITH ME HERE:\n\nFOLLOW US ON GOOGLE+: https://plus.google.com/u/0/110176035620142654779\n\nFOLLOW US ON FACEBOOK: https://www.facebook.com/wildturmeric\n\nFOLLOW US ON TWITTER: https://twitter.com/wildturmeric\n\nFOLLOW US ON PINTEREST: https://in.pinterest.com/wildturmeric\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nDISCLAIMER: The information provided on this channel is not given by a health care professional. Though each and every remedy recorded in this channel has been tried by us, each and every one of us are different and might react differently to herbs. If in doubt please contact a health care professional. All the content published in this channel are our own.....",
         "playlistId":"PLicKIlsVkGwKwfKmF9P2hXOyez4DonI-H",
         "position":2,
         "publishedAt":"2018-05-17T11:57:51.000Z",
         "resourceId":{
            "kind":"youtube#video",
            "videoId":"O7CQjnVqRxk"
         },
         "thumbnails":{
            "default":{
               "height":90,
               "url":"https://i.ytimg.com/vi/O7CQjnVqRxk/default.jpg",
               "width":120
            },
            "high":{
               "height":360,
               "url":"https://i.ytimg.com/vi/O7CQjnVqRxk/hqdefault.jpg",
               "width":480
            },
            "maxres":{
               "height":720,
               "url":"https://i.ytimg.com/vi/O7CQjnVqRxk/maxresdefault.jpg",
               "width":1280
            },
            "medium":{
               "height":180,
               "url":"https://i.ytimg.com/vi/O7CQjnVqRxk/mqdefault.jpg",
               "width":320
            },
            "standard":{
               "height":480,
               "url":"https://i.ytimg.com/vi/O7CQjnVqRxk/sddefault.jpg",
               "width":640
            }
         },
         "title":"These 3 Remedies Will Make Period Cramps (Period Pain) Go Away Instantly !"
      }
   },
   {
      "etag":"\"Bdx4f4ps3xCOOo1WZ91nTLkRZ_c/wZWoy2IcRo-nsh08W9WcBw-gepc\"",
      "id":"UExpY0tJbHNWa0d3S3dmS21GOVAyaFhPeWV6NERvbkktSC42NEZDNTU0RTRENDUzRjMz",
      "kind":"youtube#playlistItem",
      "snippet":{
         "channelId":"UCFLThAQKBzF-zYV_MtR7t4A",
         "channelTitle":"wildturmeric",
         "description":"3 Natural Remedies To Tighten Loose Skin On Stomach After Pregnancy. All these 3 natural remedies work really well in tighten sagging belly skin and ca can be used to prevent loose skin after delivery and weight loss. \n\nWhat Causes Loose Belly Skin?\n\nTry not to crash diet as it is the main reason for loose skin. When we loose weight drastically, we lose muscle along with fat which results in lose skin. \n\nHOW TO TIGHTEN LOOSE SKIN ON STOMACH AFTER PREGNANCY:\n\n1.MASSAGE OIL RECIPE FOR BELLY TIGHTENING:\n\n Take equal quantities of unrefined coconut oil and extra virgin olive oil in a bowl. Break open and add in the contents of 1 vitamin E capsule\n\n2. BELLY SCRUB TO TIGHTEN SAGGING SKIN:\n\nTake 1 tbsp of coffee powder in a bowl. Add in 1 tbsp of brown sugar in a bowl. Add in enough coconut oil to form a paste and mix well and use it as a scrub weekly once.\n\n3: MASSAGE CREAM TO TIGHTEN LOOSE SKIN ON STOMACH:\n\nTake 1 tbsp of Aloe Vera gel that is free of color and perfume in a bowl. Add in 3 drops of essential oil of choice. Finally add in the content of 1 vitamin E capsule and mix well and use it as a massage cream\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d \n\nHi Friends, My name is Ramya. I live in a small village in India and am recording all the home remedies and beauty tips that has been practiced in our village for thousands of years. I hope you will find these videos useful and if you find these videos useful, please subscribe to get regular updates....\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nYOU CAN ALSO CONNECT WITH ME HERE:\n\nFOLLOW US ON GOOGLE+: https://plus.google.com/u/0/110176035620142654779\n\nFOLLOW US ON FACEBOOK: https://www.facebook.com/wildturmeric\n\nFOLLOW US ON TWITTER: https://twitter.com/wildturmeric\n\nFOLLOW US ON PINTEREST: https://in.pinterest.com/wildturmeric\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nDISCLAIMER: The information provided on this channel is not given by a health care professional. Though each and every remedy recorded in this channel has been tried by us, each and every one of us are different and might react differently to herbs. If in doubt please contact a health care professional. All the content published in this channel are our own.....",
         "playlistId":"PLicKIlsVkGwKwfKmF9P2hXOyez4DonI-H",
         "position":3,
         "publishedAt":"2017-10-01T12:00:32.000Z",
         "resourceId":{
            "kind":"youtube#video",
            "videoId":"eCH_tKiGtR0"
         },
         "thumbnails":{
            "default":{
               "height":90,
               "url":"https://i.ytimg.com/vi/eCH_tKiGtR0/default.jpg",
               "width":120
            },
            "high":{
               "height":360,
               "url":"https://i.ytimg.com/vi/eCH_tKiGtR0/hqdefault.jpg",
               "width":480
            },
            "maxres":{
               "height":720,
               "url":"https://i.ytimg.com/vi/eCH_tKiGtR0/maxresdefault.jpg",
               "width":1280
            },
            "medium":{
               "height":180,
               "url":"https://i.ytimg.com/vi/eCH_tKiGtR0/mqdefault.jpg",
               "width":320
            },
            "standard":{
               "height":480,
               "url":"https://i.ytimg.com/vi/eCH_tKiGtR0/sddefault.jpg",
               "width":640
            }
         },
         "title":"3 Home Remedies To Tighten Loose Skin On Stomach After Pregnancy Naturally !"
      }
   },
   {
      "etag":"\"Bdx4f4ps3xCOOo1WZ91nTLkRZ_c/BEF0ejluKewMhjTZDkN9oiapkns\"",
      "id":"UExpY0tJbHNWa0d3S3dmS21GOVAyaFhPeWV6NERvbkktSC4wQTI4OEZFRUE0Q0Q3ODQw",
      "kind":"youtube#playlistItem",
      "snippet":{
         "channelId":"UCFLThAQKBzF-zYV_MtR7t4A",
         "channelTitle":"wildturmeric",
         "description":"7 top health benefits and medicinal uses of drinking fenugreek water in empty stomach. The botanical name of fenugreek seeds is Trigonella Foenum-Graecum. Fenugreek seeds are called Methi Dana in Hindi, Vendhayam in Tamil, Menthulu in Telugu, Menthe in Kannada and Uluva in Malayalam. Fenugreek seeds have wonderful medicinal uses and since most homes stock it always, if we get to know it\u0027s medicinal uses, it will always come in handy. \n\n7 TOP MEDICINAL USES OF FENUGREEK SEEDS:\n\n1. It reduces blood sugar levels.\n2. It prevents cancer\n3. It treats ulcer.\n4. It prevents diabetes in pre-diabetic patients.\n5. It aids weight loss\n6. It reduces dandruff\n7. It acts as a DHT blocker thus preventing male pattern baldness.\n\nFENUGREEK DOSAGE: 1/4 Tsp to 1/2 tsp per day.\n\nFENUGREEK SIDE EFFECTS:\nIt can lower blood sugar levels drastically. For some people it can cause allergies. If we over consume it, it will lead to upset stomach...\n\nHOW TO MAKE FENUGREEK WATER:\n\nBoil 1/4 tsp of fenugreek seeds in 1 cup of water till the color of the water changes and strain.\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d \n\nHi Friends, My name is Ramya. I live in a small village in India and am recording all the home remedies and beauty tips that has been practiced in our village for thousands of years. I hope you will find these videos useful and if you find these videos useful, please subscribe to get regular updates....\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nYOU CAN ALSO CONNECT WITH ME HERE:\n\nFOLLOW US ON GOOGLE+: https://plus.google.com/u/0/110176035620142654779\n\nFOLLOW US ON FACEBOOK: https://www.facebook.com/wildturmeric\n\nFOLLOW US ON TWITTER: https://twitter.com/wildturmeric\n\nFOLLOW US ON PINTEREST: https://in.pinterest.com/wildturmeric\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nDISCLAIMER: The information provided on this channel is not given by a health care professional. Though each and every remedy recorded in this channel has been tried by us, each and every one of us are different and might react differently to herbs. If in doubt please contact a health care professional. All the content published in this channel are our own.....",
         "playlistId":"PLicKIlsVkGwKwfKmF9P2hXOyez4DonI-H",
         "position":4,
         "publishedAt":"2017-12-15T05:17:29.000Z",
         "resourceId":{
            "kind":"youtube#video",
            "videoId":"yT8LeXmaL6g"
         },
         "thumbnails":{
            "default":{
               "height":90,
               "url":"https://i.ytimg.com/vi/yT8LeXmaL6g/default.jpg",
               "width":120
            },
            "high":{
               "height":360,
               "url":"https://i.ytimg.com/vi/yT8LeXmaL6g/hqdefault.jpg",
               "width":480
            },
            "maxres":{
               "height":720,
               "url":"https://i.ytimg.com/vi/yT8LeXmaL6g/maxresdefault.jpg",
               "width":1280
            },
            "medium":{
               "height":180,
               "url":"https://i.ytimg.com/vi/yT8LeXmaL6g/mqdefault.jpg",
               "width":320
            },
            "standard":{
               "height":480,
               "url":"https://i.ytimg.com/vi/yT8LeXmaL6g/sddefault.jpg",
               "width":640
            }
         },
         "title":"7 Reasons To Drink Fenugreek Seed Water (Methi Water) in Empty Stomach That Will Change Your Life !!"
      }
   },
   {
      "etag":"\"Bdx4f4ps3xCOOo1WZ91nTLkRZ_c/gKu-fUgclKyozzOlnTNfAx6DvxU\"",
      "id":"UExpY0tJbHNWa0d3S3dmS21GOVAyaFhPeWV6NERvbkktSC41NUMwNTVERDNBRDc4REM0",
      "kind":"youtube#playlistItem",
      "snippet":{
         "channelId":"UCFLThAQKBzF-zYV_MtR7t4A",
         "channelTitle":"wildturmeric",
         "description":"5 top side effects of turmeric for skin, face \u0026 health and how to prevent them easily at home. Turmeric has amazing health benefits but like with any ingredient it has some side effects too. If used as a spice in cooking turmeric will not cause any side effects but if used as a supplement in large doses, you should definitely get to know the side effects of turmeric.\n\nTURMERIC SIDE EFFECTS:\n\n1. Can cause stomach discomfort.\n2. Can interfere with blood sugar and blood pressure medications.\n3. Can increase blood flow.\n4. Can cause skin dryness and increase skin sensitivity.\n5. Some people might be allergic to turmeric.\n\nTURMERIC DOSAGE:\n\n1/4 TO 1/ TSP of turmeric powder per day. If you are using turmeric tincture, use 25 to 30 drops \n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d \n\nHi Friends, My name is Ramya. I live in a small village in India and am recording all the home remedies and beauty tips that has been practiced in our village for thousands of years. I hope you will find these videos useful and if you find these videos useful, please subscribe to get regular updates....\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nYOU CAN ALSO CONNECT WITH ME HERE:\n\nFOLLOW US ON GOOGLE+: https://plus.google.com/u/0/110176035620142654779\n\nFOLLOW US ON FACEBOOK: https://www.facebook.com/wildturmeric\n\nFOLLOW US ON TWITTER: https://twitter.com/wildturmeric\n\nFOLLOW US ON PINTEREST: https://in.pinterest.com/wildturmeric\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nDISCLAIMER: The information provided on this channel is not given by a health care professional. Though each and every remedy recorded in this channel has been tried by us, each and every one of us are different and might react differently to herbs. If in doubt please contact a health care professional. All the content published in this channel are our own.....",
         "playlistId":"PLicKIlsVkGwKwfKmF9P2hXOyez4DonI-H",
         "position":5,
         "publishedAt":"2018-02-23T11:49:21.000Z",
         "resourceId":{
            "kind":"youtube#video",
            "videoId":"Eb1sO7WpA1U"
         },
         "thumbnails":{
            "default":{
               "height":90,
               "url":"https://i.ytimg.com/vi/Eb1sO7WpA1U/default.jpg",
               "width":120
            },
            "high":{
               "height":360,
               "url":"https://i.ytimg.com/vi/Eb1sO7WpA1U/hqdefault.jpg",
               "width":480
            },
            "maxres":{
               "height":720,
               "url":"https://i.ytimg.com/vi/Eb1sO7WpA1U/maxresdefault.jpg",
               "width":1280
            },
            "medium":{
               "height":180,
               "url":"https://i.ytimg.com/vi/Eb1sO7WpA1U/mqdefault.jpg",
               "width":320
            },
            "standard":{
               "height":480,
               "url":"https://i.ytimg.com/vi/Eb1sO7WpA1U/sddefault.jpg",
               "width":640
            }
         },
         "title":"Turmeric (Haldi) Side Effects For Skin \u0026 Health: Watch This Before Using Turmeric Again !!!"
      }
   },
   {
      "etag":"\"Bdx4f4ps3xCOOo1WZ91nTLkRZ_c/qEZyYG3XtOwXrHrt_ZGdmSuUJQY\"",
      "id":"UExpY0tJbHNWa0d3S3dmS21GOVAyaFhPeWV6NERvbkktSC41MzJFNEYxODEyNzA0QUUx",
      "kind":"youtube#playlistItem",
      "snippet":{
         "channelId":"UCFLThAQKBzF-zYV_MtR7t4A",
         "channelTitle":"wildturmeric",
         "description":"How to treat diaper rash in toddlers, newborns and infants. Best homemade diaper rash cream that is clinically proven. In this video, I wanted to share a clinically proven homemade diaper rash cream that helps start 93% of wound healing in the first 6 hours of application.\n\nAble to heal diaper rash with a simple homemade rash cream equal to prescription medication is amazing! This cream is very gentle to be used on baby\u0027s skin and has no side effects at all.\n\nThe research paper supporting these claims: https://www.ncbi.nlm.nih.gov/pubmed/26831423\n\nThe first ingredient we need is bentonite clay. It\u0027s a healing clay got from the ash of volcanoes. Calendula extract is supposed to be the most effective for diaper rash but bentonite clay has been proven to be even more effective than calendula, this is because it draws out toxins very effectively thus helping in very fast wound healing. You can buy bentonite clay through online shops. I would suggest using only bentonite clay for best results. \n\nThe second ingredient we need is aloe vera juice, to make aloe vera juice cut the leaf of an aloe vera plant. Wash, pat dry and remove the thorns on both sides of the leaf. Now cut in half, scoop out the flesh and grind in a mixer without adding any water to get a smooth juice. Aloe vera juice spoils very soon but one amazing thing about this cream is when Aloe Vera juice is mixed with the clay it does not spoil for three days if left at room temperature and don\u0027t use store-bought Aloe Vera gel, it does not mix well with the clay and it is always best to use fresh aloe vera juice. Aloe Vera helps heal the wound very fast. \n\nThe last ingredient we need is lavender oil. Lavender essential oil has anti-inflammatory properties that helps bring down the inflammation and is very very healing. You can order lavender\nessential oil easily through online shops. \n\nI wanted to make this recipe into an ASMR video. We were going through a very severe drought but now it has rained and the whole village looks green and beautiful. We have these beautiful yellow flowers popping all over the farm and I have taken this video using them as a background.You can store this cream at room temperature for two to three days but it is best to make it fresh every day. \n\nTo use, apply a thin layer of this cream on the affected area twice daily wash it off after an hour or two.\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d \n\nHi Friends, My name is Ramya. I live in a small village in India and am recording all the home remedies and beauty tips that has been practiced in our village for thousands of years. I hope you will find these videos useful and if you find these videos useful, please subscribe to get regular updates....\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nYOU CAN ALSO CONNECT WITH ME HERE:\n\nFOLLOW US ON GOOGLE+: https://plus.google.com/u/0/110176035620142654779\n\nFOLLOW US ON FACEBOOK: https://www.facebook.com/wildturmeric\n\nFOLLOW US ON TWITTER: https://twitter.com/wildturmeric\n\nFOLLOW US ON PINTEREST: https://in.pinterest.com/wildturmeric\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nDISCLAIMER: The information provided on this channel is not given by a health care professional. Though each and every remedy recorded in this channel has been tried by us, each and every one of us are different and might react differently to herbs. If in doubt please contact a health care professional. All the content published in this channel are our own.....",
         "playlistId":"PLicKIlsVkGwKwfKmF9P2hXOyez4DonI-H",
         "position":6,
         "publishedAt":"2018-05-28T10:09:26.000Z",
         "resourceId":{
            "kind":"youtube#video",
            "videoId":"brjUpmKbRMA"
         },
         "thumbnails":{
            "default":{
               "height":90,
               "url":"https://i.ytimg.com/vi/brjUpmKbRMA/default.jpg",
               "width":120
            },
            "high":{
               "height":360,
               "url":"https://i.ytimg.com/vi/brjUpmKbRMA/hqdefault.jpg",
               "width":480
            },
            "maxres":{
               "height":720,
               "url":"https://i.ytimg.com/vi/brjUpmKbRMA/maxresdefault.jpg",
               "width":1280
            },
            "medium":{
               "height":180,
               "url":"https://i.ytimg.com/vi/brjUpmKbRMA/mqdefault.jpg",
               "width":320
            },
            "standard":{
               "height":480,
               "url":"https://i.ytimg.com/vi/brjUpmKbRMA/sddefault.jpg",
               "width":640
            }
         },
         "title":"How To Treat Diaper Rash Fast | Best Homemade Diaper Rash Cream (INDIAN VILLAGE ASMR VIDEO)"
      }
   },
   {
      "etag":"\"Bdx4f4ps3xCOOo1WZ91nTLkRZ_c/J-LA9gvr80xrOOWc-uiYjGKxw-g\"",
      "id":"UExpY0tJbHNWa0d3S3dmS21GOVAyaFhPeWV6NERvbkktSC4zNEMzQ0FDREY1MkE1RkQ1",
      "kind":"youtube#playlistItem",
      "snippet":{
         "channelId":"UCFLThAQKBzF-zYV_MtR7t4A",
         "channelTitle":"wildturmeric",
         "description":"5 top benefits \u0026 side effects of drinking warm lemon water every day morning. Lemon water has amazing health benefits but if you are planning on taking it on a daily basis, I would suggest getting to know the side effects too.\n\n10 TOP BENEFITS \u0026 SIDE EFFECTS OF DRINKING WARM LEMON WATER EVERYDAY MORNING:\n\n1. It aids weight loss\n2. It improves digestion.\n3. Prevent mouth odor.\n4. boosts energy.\n5. Improves immunity.\n6. Increases iron absorption.\n7. Makes the skin glow\n\n SIDE EFFECTS:\n\n8. Affects enamel if had on a daily basis.\n9. Worsens gastric ulcers.\n10.Worsens pain during canker sores\n\nHOW TO MAKE LEMON WATER | 3 TOP WAYS\n\n1. LEMON WATER WITH HONEY:\n\nTake a cup of warm water. Add in the slices of half a fresh lemon. Add in honey to taste. Let steep for 10 minutes before drinking.\n\n2. LEMON WATER WITH CUCUMBER  :\n\nTake a cup of water. Add in the slices of half a fresh lemon. Add in slices of half a cucumber. Let steep for 10 minutes before drinking.\n\n3. LEMON WATER WITH GINGER:\n\nTake a cup of warm water. Add in the slices of a small piece of fresh ginger. Add in honey to taste. Let steep for 10 minutes before drinking.\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d \n\nHi Friends, My name is Ramya. I live in a small village in India and am recording all the home remedies and beauty tips that has been practiced in our village for thousands of years. I hope you will find these videos useful and if you find these videos useful, please subscribe to get regular updates....\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nYOU CAN ALSO CONNECT WITH ME HERE:\n\nFOLLOW US ON GOOGLE+: https://plus.google.com/u/0/110176035620142654779\n\nFOLLOW US ON FACEBOOK: https://www.facebook.com/wildturmeric\n\nFOLLOW US ON TWITTER: https://twitter.com/wildturmeric\n\nFOLLOW US ON PINTEREST: https://in.pinterest.com/wildturmeric\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nDISCLAIMER: The information provided on this channel is not given by a health care professional. Though each and every remedy recorded in this channel has been tried by us, each and every one of us are different and might react differently to herbs. If in doubt please contact a health care professional. All the content published in this channel are our own.....",
         "playlistId":"PLicKIlsVkGwKwfKmF9P2hXOyez4DonI-H",
         "position":7,
         "publishedAt":"2018-06-14T13:08:45.000Z",
         "resourceId":{
            "kind":"youtube#video",
            "videoId":"yJJ6qjkiFtE"
         },
         "thumbnails":{
            "default":{
               "height":90,
               "url":"https://i.ytimg.com/vi/yJJ6qjkiFtE/default.jpg",
               "width":120
            },
            "high":{
               "height":360,
               "url":"https://i.ytimg.com/vi/yJJ6qjkiFtE/hqdefault.jpg",
               "width":480
            },
            "maxres":{
               "height":720,
               "url":"https://i.ytimg.com/vi/yJJ6qjkiFtE/maxresdefault.jpg",
               "width":1280
            },
            "medium":{
               "height":180,
               "url":"https://i.ytimg.com/vi/yJJ6qjkiFtE/mqdefault.jpg",
               "width":320
            },
            "standard":{
               "height":480,
               "url":"https://i.ytimg.com/vi/yJJ6qjkiFtE/sddefault.jpg",
               "width":640
            }
         },
         "title":"10  Unknown Benefits \u0026 Side Effects Of Drinking Warm Lemon Water Every Day Morning !"
      }
   },
   {
      "etag":"\"Bdx4f4ps3xCOOo1WZ91nTLkRZ_c/8PRhCBzzcu4CLxUSTAQkbc2eosE\"",
      "id":"UExpY0tJbHNWa0d3S3dmS21GOVAyaFhPeWV6NERvbkktSC5BQzRBQzNEOTgzNTU2QkZB",
      "kind":"youtube#playlistItem",
      "snippet":{
         "channelId":"UCFLThAQKBzF-zYV_MtR7t4A",
         "channelTitle":"wildturmeric",
         "description":"Miracle herb that cures dandruff permanently \u0026 naturally at home fast. Best home remedy for dandruff! The herb that effectively treats dandruff is called Phyla Nodiflora. It is called Turkey Tangle in English, Poduthalai in Tamil and Bukan in Hindi. This amazing herb treats dandruff very very effectively and has long been used for treating dandruff in Tamil Nadu. What causes dandruff? Dandruff can be caused due to many reasons like shampooing too often, dry scalp, fungal infections and scalp problems like psoriasis and eczema. The best way to treat dandruff at home is with natural herbs that have anti septic and anti microbial properties and this herb is one of the best herbs for treating dandruff at home easily. We usually make a hair oil and hair pack with the fresh leaves. If you don\u0027t have access to the fresh leaves, you can make the hair pack using the powder too.\n\n2 BEST HOME REMEDIES FOR DANDRUFF:\n\n1. DANDRUFF HAIR OIL:\n\nFor making poduthalai hair oil, boil coconut oil with fresh poduthalai leaves till it loses it\u0027s water content. Switch off, cool and strain and use it as a hair oil to get rid of dandruff.\n\n2. DANDRUFF HAIR PACK:\n\nFor the hair pack, take required amount of poduthalai powder in a bowl, add in enough rice water and 1/4 tsp of coconut oil to it and apply as a hair pack. Wait for 30 minutes before having hair wash. This hair pack also treats dandruff very effectively. \n\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d \n\nHi Friends, My name is Ramya. I live in a small village in India and am recording all the home remedies and beauty tips that has been practiced in our village for thousands of years. I hope you will find these videos useful and if you find these videos useful, please subscribe to get regular updates....\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nYOU CAN ALSO CONNECT WITH ME HERE:\n\nFOLLOW US ON GOOGLE+: https://plus.google.com/u/0/110176035620142654779\n\nFOLLOW US ON FACEBOOK: https://www.facebook.com/wildturmeric\n\nFOLLOW US ON TWITTER: https://twitter.com/wildturmeric\n\nFOLLOW US ON PINTEREST: https://in.pinterest.com/wildturmeric\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nDISCLAIMER: The information provided on this channel is not given by a health care professional. Though each and every remedy recorded in this channel has been tried by us, each and every one of us are different and might react differently to herbs. If in doubt please contact a health care professional. All the content published in this channel are our own.....",
         "playlistId":"PLicKIlsVkGwKwfKmF9P2hXOyez4DonI-H",
         "position":8,
         "publishedAt":"2018-06-14T13:12:53.000Z",
         "resourceId":{
            "kind":"youtube#video",
            "videoId":"R6cblD80xYY"
         },
         "thumbnails":{
            "default":{
               "height":90,
               "url":"https://i.ytimg.com/vi/R6cblD80xYY/default.jpg",
               "width":120
            },
            "high":{
               "height":360,
               "url":"https://i.ytimg.com/vi/R6cblD80xYY/hqdefault.jpg",
               "width":480
            },
            "maxres":{
               "height":720,
               "url":"https://i.ytimg.com/vi/R6cblD80xYY/maxresdefault.jpg",
               "width":1280
            },
            "medium":{
               "height":180,
               "url":"https://i.ytimg.com/vi/R6cblD80xYY/mqdefault.jpg",
               "width":320
            },
            "standard":{
               "height":480,
               "url":"https://i.ytimg.com/vi/R6cblD80xYY/sddefault.jpg",
               "width":640
            }
         },
         "title":"This Miracle HERB Cures Dandruff Permanently in 5 Minutes !"
      }
   },
   {
      "etag":"\"Bdx4f4ps3xCOOo1WZ91nTLkRZ_c/XzczFGa6iuVigT8maZGl_LF5PR8\"",
      "id":"UExpY0tJbHNWa0d3S3dmS21GOVAyaFhPeWV6NERvbkktSC4wMEMyQTBBOTUwNTM0OUFG",
      "kind":"youtube#playlistItem",
      "snippet":{
         "channelId":"UCFLThAQKBzF-zYV_MtR7t4A",
         "channelTitle":"wildturmeric",
         "description":"2 natural ayurvedic white hair treatments (home remedies) to turn white \u0026 grey hair into black naturally \u0026 permanently in young age.  In this video you will find a white hair oil recipe (hair oil to turn hair black) and a hair mask to turn white hair black. These 2 ayurvedic treatments reverses existing grey and white hair and stops hair further from turning grey completely and permanently. These 2 wonderful ayurvedic home remedies have been used in India from ancient times and they really work their magic if used regularly. The base ingredient used in these two remedies are amla. Amla has been used for treating black and grey hair for centuries in India and in my humble opinion is the best ingredient to use for reversing grey and white hair.\n\nHAIR OIL RECIPE TO TURN WHITE \u0026 GREY HAIR BLACK:\n\n1/4 CUP COCONUT OIL\nDRIED AMLA PIECES\n\nMETHOD:\nFor making this oil you need dried amla pieces. You can make your own dried amla by cutting and sun drying it or you can buy it from the shops. To make the oil, heat coconut oil in an iron pan, once hot add in the amla pieces. It will start swelling up immediately. Once the swelling stops, switch off or else it will burn. Let cool, strain and bottle it. To use, massage this oil onto the hair and scalp regularly.\n\nHAIR MASK TO TURN WHITE HAIR INTO BLACK NATURALLY:\nAMLA JUICE: 2 TBSP\nEXTRA VIRGIN OLIVE OIL: 1  TBSP\n\nMETHOD:\nFor the mask, take 5 to 10 fresh amla and cut into small pieces. Remove the seed and discard. Grind the amla pieces in a mixer without adding any water and extract the juice. Now for every 2 tbsp of amla juice add 1 tbsp of extra virgin olive oil and mix well. Apply on the scalp and hair. \n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\nHi Friends, My name is Ramya. I live in a small village in India and am recording all the home remedies and beauty tips that has been practiced in our village for thousands of years. I hope you will find these videos useful and if you find these videos useful, please subscribe to get regular updates. Also please share this video with your friends and leave your feed back in the comment section, I will be very happy if you do so..:)\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nWATCH MY OTHER VIDEOS HERE:\n\nBest Natural Indian Home Remedy For Fast Hair Growth \u0026 Thickness: https://youtu.be/X5N9X5_YQ9w\n\nHomemade Indian Ayurvedic Herbal Hair Growth Oil For Long, Thick \u0026 Healthy Hair: https://youtu.be/gEyDbpuSnlU\n\nDIY Best All Natural Organic Homemade Shampoo Recipe : https://youtu.be/kMG7z9iJBJc\n\nDIY Best Homemade Hair Mask Recipe For Dry, Damaged \u0026 Frizzy Hair: Home Remedy For Dry Damaged Hair: https://youtu.be/Nq1vlPuPK38\n\nSuper Fast Hibiscus Hair Growth Oil For Long,Thick, Black, Healthy Hair |  Stop Hair Fall \u0026 Dandruff: https://youtu.be/VnhU_bCaWEg\n\nHow To Use Mustard Oil For Hair Growth: Hair Benefits Of Mustard Oil: https://youtu.be/4xJ3PauqCrg\n\nCoconut Milk For Hair Growth: https://youtu.be/NgNlyiUZiZ4\n\nOnion Hair Mask: https://youtu.be/u04VuQraEnE\n\nHow To Use | Apply Curd for Hair Growth \u0026 Dandruff: Curd Hair Pack | Mask Recipe: https://youtu.be/iazV8LfpSo0\n\nDIY At Home Natural Hair Straightening Cream With Aloe Vera \u0026 Flax Seed Gel | Best Remedy : https://youtu.be/lGSOikTe_mw\n\nHow To Use Castor Oil For Hair Growth (Arandi Oil In Hindi): https://youtu.be/tUL_p3M-ss8\n\nHow To Make \u0026 Use Patanjali Amla Juice For Hair Regrowth \u0026 Skin Glow At Home !!!: https://youtu.be/ygRf47I_Xdo\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\nDISCLAIMER: The information provided on this channel is not given by a health care professional. Though each and every remedy recorded in this channel has been tried by us, each and every one of us are different and might react differently to herbs. If in doubt please contact a health care professional. All the content published in this channel are our own.....",
         "playlistId":"PLicKIlsVkGwKwfKmF9P2hXOyez4DonI-H",
         "position":9,
         "publishedAt":"2018-06-14T13:30:30.000Z",
         "resourceId":{
            "kind":"youtube#video",
            "videoId":"HL35D3lbfvA"
         },
         "thumbnails":{
            "default":{
               "height":90,
               "url":"https://i.ytimg.com/vi/HL35D3lbfvA/default.jpg",
               "width":120
            },
            "high":{
               "height":360,
               "url":"https://i.ytimg.com/vi/HL35D3lbfvA/hqdefault.jpg",
               "width":480
            },
            "maxres":{
               "height":720,
               "url":"https://i.ytimg.com/vi/HL35D3lbfvA/maxresdefault.jpg",
               "width":1280
            },
            "medium":{
               "height":180,
               "url":"https://i.ytimg.com/vi/HL35D3lbfvA/mqdefault.jpg",
               "width":320
            },
            "standard":{
               "height":480,
               "url":"https://i.ytimg.com/vi/HL35D3lbfvA/sddefault.jpg",
               "width":640
            }
         },
         "title":"2 White Hair Treatments At Home Naturally | Turn White \u0026 Grey Hair To Black Permanently"
      }
   }
]